{"pageProps":{"postData":{"id":"our-team","contentHtml":"<p>At MyWebClass.org, we're proud of our diverse and dedicated team, committed to revolutionizing education for the AI-driven world. Our team members bring a wealth of experience, knowledge, and innovative ideas to drive our mission forward. Get to know the inspiring individuals who are shaping the future of education.</p>\n<p> </p>\n<p> </p>\n<p><strong>Team Members:</strong></p>\n<p> </p>\n<ol>\n<li>Dr. Jane Robinson - Founder &#x26; CEO\nDr. Jane Robinson, a visionary educator with a passion for innovation, founded MyWebClass.org to transform traditional classrooms into Agile and Lean learning spaces. With a Ph.D. in Education, she has over 20 years of experience in teaching and administration. Her leadership guides our mission to prepare students for a rapidly evolving world.</li>\n</ol>\n<p> </p>\n<ol start=\"2\">\n<li>Michael Chen - Chief Technology Officer (CTO)\nMichael is our technology whiz, responsible for overseeing the development and maintenance of our platform. With a background in computer science and a passion for AI-driven education, he ensures that our technological solutions are cutting-edge, secure, and accessible to all learners.</li>\n</ol>\n<p> </p>\n<ol start=\"3\">\n<li>Laura Sanchez - Head of Marketing &#x26; Communications\nLaura is a seasoned marketing professional with a knack for storytelling. She leads our marketing and communications efforts, ensuring that our message reaches educators, schools, and communities worldwide. Laura is dedicated to promoting the benefits of Agile and Lean principles in education.</li>\n</ol>\n<p> </p>\n<ol start=\"4\">\n<li>Dr. Kofi Mensah - Research &#x26; Development Lead\nDr. Kofi Mensah, a renowned education researcher, guides our research initiatives and helps us identify best practices and emerging trends in AI-driven education. With a doctorate in Educational Psychology, he is passionate about understanding the cognitive, social, and emotional aspects of learning.</li>\n</ol>\n<p> </p>\n<ol start=\"5\">\n<li>Eliza Taylor - Head of Content &#x26; Curriculum Development\nEliza is an experienced curriculum designer and content creator who leads our efforts in developing innovative educational resources and tools. She works closely with educators to create engaging learning experiences that foster creativity, adaptability, and collaboration in the classroom.</li>\n</ol>\n<p> </p>\n<ol start=\"6\">\n<li>Pierre Dubois - Internationalization &#x26; Localization Manager\nPierre, a multilingual professional with a background in linguistics, leads our internationalization efforts. He is responsible for ensuring that our resources and tools are available to educators and students across the globe, bridging cultural and linguistic gaps in education.</li>\n</ol>\n<p> </p>\n<ol start=\"7\">\n<li>Thomas Anderson - Volunteer &#x26; Community Engagement Coordinator\nThomas is the heart of our volunteer program, working closely with developers, educators, and other professionals who are passionate about transforming education. He fosters a thriving community of volunteers and ensures they have the resources and support needed to make a lasting impact.</li>\n</ol>\n<p> </p>\n<p> </p>\n<p>We're always on the lookout for talented individuals who share our mission to revolutionize education for the AI-driven world. If you're interested in joining our team, explore our open positions or sign up as a volunteer today! Together, we can create a brighter future for learners everywhere.</p>\n","title":"Meet the Passionate Team Behind MyWebClass.org","date":"2022-01-01"}},"__N_SSG":true}